{"bio" : "<p>Cătălina has an extensive experience in User Experience and Design, Design Thinking, call is as you please, it’s still design language. She led the creation of digital experiences in companies such as Vodafone, ING Bank  and Electronic Arts, where from 2017 to 2019, she lead the Romanian UX team for FIFA.</p><p>At ING she went from coordinating innovative digital campaigns, making ING one of the most loved Romanian brands in social media, to being the person behind the experience of ING Bank’s internet banking, Home’Bank.</p><p> She left the corporate world to dedicate her full time as an entrepreneur, being a co-founder of the Design Thinking Society (founded in 2017) with, what she proudly says, other 3 of the best makers and designers in Romania, on their way to make some changes around design in Romania. They are an Innovation and Design consultancy boutique offering companies and startups consultancy to improve their products and services. Catalina is also a UX trainer, mentor and advocate of design thinking approach. She is a certified Google Developer UX expert and invest effort and time in developing and supporting the tech communities. She’s driven and curious.</p>",
    "company" : "Design Thinking Society",
    "companyLogo" : "",
    "companyLogoUrl" : "",
    "country" : "Bucharest, Romania",
    "featured" : true,
    "name" : "Cătălina Bănuleasa",
    "photo" : "/images/people/catalina_banuleasa.jpg",
    "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest-2019-craiova.appspot.com/o/speakers%2FCatalina.png?alt=media&token=0d1a2343-a4e7-4551-808f-0d3076549a3a",
    "pronouns": "she/her",
    "shortBio" : "Catalina has an extensive experience in User Experience and Design, Design Thinking, call is as you please, it’s still design language. She led the creation of digital experiences in companies as Vodafone, ING Bank. and Electronic Arts, where from 2017 to 2019, she lead the Romanian UX team for FIFA.",
    "socials" : [{
        "icon" : "linkedin",
        "link" : "https://www.linkedin.com/in/alinacatalina/",
        "name" : "LinkedIn"
      } ],
    "badges": [ {
      "description" : "Google Developer Expert for UX",
      "link" : "https://www.linkedin.com/in/alinacatalina/",
      "name" : "gde"
      } ],
    "order" : 1,
    "title" : "Co-Founder"
  }